Name:

Name of Peer who worked with you:

Favorite Place to Get lunch on-Campus:

## Introduction to Notebooks

Jupyter: Line by line compilation, allows to showcase your work as a data scientist

## The Much Awaited, "Hello World!"

In [28]:
print('Hello World!')

Hello World!

In [29]:
print("Hi")

Hi

In [30]:
print ('Hello # world')

Hello # world

In [31]:
print ("hello # world")

hello # world

In [32]:
2 + 3

5

In [33]:
print('Hello', 'world!')

Hello world!

In [34]:
Print('Python, whats 1 + 2')

NameError: name 'Print' is not defined

So make sure you write print in small and not Print

## Scalar Objects

scalar vs non scalar objects: 
scalar objects are indepenedent and they do not have internal structure. They are atomic objects
non-scalar objects have internal structure with set of atomic elements.

Python stores different object differently based on the use. 

for us 2+2 and 2.000000000 + 2.000000000 are same. But for computer, they are not! Every zero that we add, it adds a bit of memory and complexes the computation.

So we tell the datatype to computer beforehand.

So 3 basic data types are integer, float and boolean.

1)int is used for integers e.g. 1, 0, 1000, 5000
like no of children, no of cars, etc. 

2)float is used to represent real numbers e.g. 3.0, 4.0, 100.5, 3.14, 4e3(4 times 10 to the power of 2) etc

3)boolean is used for binary like True and False.
Pass or fail

4)There are some types like None, long integers which we talk about later 

So what should be the data type of following variables?
We want to design a demographic table. What data type would you assign
Age, no of courses taken, Height , weight, Married/unmarried

In [2]:
type(1)

int

In [3]:
type(1.0)

float

In [4]:
4e2

400.0

In [5]:
type(4e4)

float

In [6]:
1==0

False

In [7]:
type(1==1)

bool

In [8]:
type(False)

bool

In [9]:
type(True)

bool

In [10]:
 4 + 5 == 6

False

In [11]:
2 + 3 ==5

True

In [12]:
int(5.0)

5

In [13]:
float(5)

5.0

In [14]:
bool(5)

True

In [15]:
bool(0)

False

In [16]:
bool(1)

True

In [17]:
int(5.8)

5

In [18]:
(3+2)==(1+4)

True

In [19]:
((3+2)==(1+4)) == (4%2==1)

False

## Operators

There are some basic data operators 
+ plus
- minus
/ divide
* multiply
% reminder (I % j is pronounced as “i mod j”)
** power 
< less- than
> greater- than
<= less- than- equal
>= greater- than- equal
== check equality 
!= check inequality

In [20]:
2+3

5

In [21]:
3-2

1

In [22]:
3*2

6

In [23]:
10/2

5.0

In [24]:
11/2

5.5

In [25]:
int(11/2)

5

In [26]:
35%4

3

In [27]:
4**3

64

In [28]:
5<2

False

In [29]:
5<5

False

In [30]:
5<=5

True

In [31]:
print('what is 5 - 7?', 5 - 7)

what is 5 - 7? -2

In [32]:
int(5) + float(3.2)

8.2

In [33]:
1 + 2 == 3

True

In [34]:
3 + 4 == 7

True

In [35]:
2 + 3 == 4

False

In [36]:
0.1 + 0.2 == 0.3

False

## Variables and assignments

Variables provide a way to associate names with objects. These names, associated with objects can be used and called again and again, instead of objects. 
An assignment statement associates the name to the left of ‘=’ to the object denoted by the expression to the right of ‘=’. 


Its like naming somebody.

In [37]:
pi = 3.1416

In [38]:
pi

3.1416

In [41]:
## Write your code chunk to print the area of a circle with radius = 4 units.  [Note: This is how comments are written in jupyter notebooks]

In [42]:
my name = 'python'

SyntaxError: invalid syntax (<ipython-input-42-61d7743a8c60>, line 1)

we have to give continuous name to variable. So 'my name' is not valid, but 'my_name' is valid.

In [43]:
my_name = 'whatever'

In [44]:
my_name

'whatever'

In [45]:
#From the previously written code of printing the area of a circle, print out the below statement using the variables assigned previously
print('when radius of a circle is ' + str(radius) +' units then area of circle is '+ str(area) +' square units')

when radius of a circle is 4 units then area of circle is 50.2656 square units

In [46]:
print('when radius of a circle is %d units then area of circle is %f square units' %(radius,area))

when radius of a circle is 4 units then area of circle is 50.265600 square units

In [47]:
universities = '\nDuke \nstanford \nMIT \nCaltech'
print('A few good universities:', universities  )

A few good universities:
Duke
stanford
MIT
Caltech

Reserved Keywords: and, del, from, not, while, as, elif, global, or, with, assert, else, if, pass, yield, break, except, import, print, class, exec, in, raise, continue, finally, is, return, def, for, lambda, try

we can not use reserved keywords as our variable name. For e.g, we can not say 
and = 0.3

Readability of code:
a = 3.1416                                           pi = 3.1416                                 
b = 4                                                radius = 4 
c = a*(b**2)                                         area = pi*(r**2)
Which code makes more sense?

In [48]:
##### Finding number is odd or even

odd_even = [1,2,3,4,5,6,7,8,9,10]
for num in odd_even:
    if num % 2 == 0:
        print ('%d is even' %num)
    elif num % 2 == 1:
        print ('%d is odd' %num)

1 is odd
2 is even
3 is odd
4 is even
5 is odd
6 is even
7 is odd
8 is even
9 is odd
10 is even

In [49]:
# Finding roots of Quadratic equation
# Assume that quadratic equation is of the form of Ax^2 + Bx + C = 0

a = int(input('What is a?'))
b = int(input('What is b?'))
c = int(input('What is c?'))

d = (b**2) - (4*a*c ) 

root1 = (-b + d**0.5 )/(2*a)
root2 = (-b - d**0.5 )/(2*a)

print ('2 roots of quardatic equation are ' + str(root1) + ' & ' + str(root2))

What is a?1
What is b?2
What is c?3
2 roots of quardatic equation are (-0.9999999999999999+1.4142135623730951j) & (-1-1.4142135623730951j)

In [53]:
# A bit more complicated code

a = int(input('What is a?'))
b = int(input('What is b?'))
c = int(input('What is c?'))


d = (b**2) - (4*a*c) # discriminant

if d < 0:
    print ("This equation has no real solution")
elif d == 0:
    x = (-b+ (d**0.5)) / (2*a)
    print ("This equation has one solutions: ",x)
    print ((2+10) * (10+3))
else:
    x1 = (-b + (d**0.5))/2*a
    x2 = (-b - (d**0.5))/2*a
    print ("This equation has two solutions: ", x1, " and", x2)

What is a?3
What is b?4
What is c?5
This equation has no real solution

NOTE: Please Make sure to edit the notebook, fill in your code chunks, commit and push the notebook to your github repository by the end  of class.

 # Introduction to Common Libraries

# Introduction to Pandas
Using pandas for data analysis.

You can think of pandas as an extremely powerful version of Excel, with a lot more features, the main advantage of being, pandas can open very large files very easily. Especially, if you have an excel file with more than 40,000 rows, It becomes a cumbersome exercise to keep working with excel.

In this section of the course, we will go through the topics in this order:

Introduction to Pandas

1. Series
2. DataFrames
3. Operations
4. Missing Data

# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object).
What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. 

It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.
Let's explore this concept through some examples:

In [2]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]

# Create a numpy array  and a dictionary 
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [5]:
# Create a series by passing the list and labels index. Series is just like a numpy array
# the only difference is you can access the data using labels instead of numbers

series1 = pd.Series(data = my_list,index = labels)
series1

a    10
b    20
c    30
dtype: int64

In [6]:
# you can pass a dictionary directly to get a series
series2 = pd.Series(d)
series2

a    10
b    20
c    30
dtype: int64

In [7]:
# Now, we are creating the series by passing a numpy array 

series3 = pd.Series(arr,labels)
series3

a    10
b    20
c    30
dtype: int64

# Using an Index
The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary). Let's see some examples of how to grab information from a Series. Let us create two series, seriesA and seriesB:

In [8]:
seriesA = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan']) 
seriesA

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [9]:
seriesB = pd.Series([5,6,7,8],index = ['USA', 'Australia','UK', 'Japan']) 
seriesB

USA          5
Australia    6
UK           7
Japan        8
dtype: int64

In [10]:
# If we want to access the data, we use the label as index 
seriesA['USA']

1

In [11]:
seriesB['UK']

7

In [12]:
# you can also perform operations using series indexes
# if the data is not there or you forcefully try to add the series , 
# then it will create a NaN object
seriesC = seriesA + seriesB
seriesC

Australia     NaN
Germany       NaN
Japan        12.0
UK            NaN
USA           6.0
USSR          NaN
dtype: float64

# DataFrames
DataFrames are the workhorse of pandas and are directly inspired by the R programming language.

We can think of a DataFrame as a bunch of Series objects put together to share the same index. 
Imagine dataframes as a collection of series- added as columns . Now we can give column labels too.

Let's use pandas to explore this topic!

In [4]:
# lets create a numpy array of random integers
arr = np.random.randint(1,100,20)

In [7]:
# Now, lets create a dataframe. This is the syntax 
# .reshape function is just to change the numpy array as per your required dimensions
df = pd.DataFrame(arr.reshape(4,5),index = ['A','B','C','D'],columns=['P','Q','R','S','T'])
df

    P   Q   R   S   T
A  11  57  28  43  49
B  76  16  99   4  62
C  42  37  91  23  68
D  55  99  99  51  39

In [15]:
# you can also pass a string and then use the split operator to create the index as shown below
df1 = pd.DataFrame(arr.reshape(4,5),index = 'A B C D'.split(),columns=['P','Q','R','S','T'])
df1

    P   Q   R   S   T
A  92  76  51  16  29
B  63  43  37  27   2
C  18  65   2  80  42
D  79  70  99   2  60

# Selection and Indexing
Now , we have created the dataframe, we will now explore the various ways to access the dataframe

In [16]:
# If you want to get a single column, 
df['Q']
# df['P'] or df['R'] or df['S'] or df['T']  works

A    76
B    43
C    65
D    70
Name: Q, dtype: int64

In [17]:
# if you want to access 2 columns at the same time, pass it as a list of columns 
df[['P','Q']]

    P   Q
A  92  76
B  63  43
C  18  65
D  79  70

In [9]:
# The same concept can be extended to more than 2 columns too 
df[['P','Q','R']]

    P   Q   R
A  11  57  28
B  76  16  99
C  42  37  91
D  55  99  99

In [19]:
# if you want to access specific rows using the index , we have to use the dot operator --> .loc[pass the index] 
df.loc['A']

P    92
Q    76
R    51
S    16
T    29
Name: A, dtype: int64

In [20]:
# if you want more than one row , pass the index as a list
df.loc[['A','B']]

    P   Q   R   S   T
A  92  76  51  16  29
B  63  43  37  27   2

In [21]:
# same example, carried for 
df.loc[['A','C']]

    P   Q   R   S   T
A  92  76  51  16  29
C  18  65   2  80  42

In [11]:
# how to access specific rows and columns 
# first access specific rows using the .loc operator, then select specific columns after that like shown below
df.loc[['B','C','D']][['R','S','T']]

    R   S   T
B  99   4  62
C  91  23  68
D  99  51  39

In [15]:
df.iloc[2]

P    42
Q    37
R    91
S    23
T    68
Name: C, dtype: int32

In [23]:
# use can also select column first and then row later
df[['P','R','T']].loc[['A','C','D']]

    P   R   T
A  92  51  29
C  18   2  42
D  79  99  60

In [24]:
# How to create a new column or new row in addition to the existing data frame

In [25]:
df

    P   Q   R   S   T
A  92  76  51  16  29
B  63  43  37  27   2
C  18  65   2  80  42
D  79  70  99   2  60

In [17]:
df['new_col'] = df['P'] + df['Q'] + df['R']+ df['S']

In [18]:
df

    P   Q   R   S   T  new_col
A  11  57  28  43  49      139
B  76  16  99   4  62      195
C  42  37  91  23  68      193
D  55  99  99  51  39      304

In [19]:
# to create a new row , use the .operator and use .loc syntax 
df.loc['new_row'] = df.loc['A'] + df.loc['B']

In [20]:
# check the dataframe again 
df

          P   Q    R   S    T  new_col
A        11  57   28  43   49      139
B        76  16   99   4   62      195
C        42  37   91  23   68      193
D        55  99   99  51   39      304
new_row  87  73  127  47  111      334

In [21]:
# How to delete rows and columns , we use the .drop syntax 
# if you want to drop columns, you give axis =1. 
# in Python, and in especially pandas, axis =1 indicates columns and axis=0 indicates rows 
df.drop('new_col',axis=1, inplace = True)

In [22]:
# It wont drop the column until you give inplace= True condition 
df

          P   Q    R   S    T
A        11  57   28  43   49
B        76  16   99   4   62
C        42  37   91  23   68
D        55  99   99  51   39
new_row  87  73  127  47  111

In [32]:
df.drop('new_col', axis=1, inplace= True )
# now it will drop that column properly

In [33]:
df

           P    Q   R   S   T
A         92   76  51  16  29
B         63   43  37  27   2
C         18   65   2  80  42
D         79   70  99   2  60
new_row  155  119  88  43  31

In [23]:
# if you want to drop the row permanently use the same syntax, 
# except for that , use axis=0
df.drop('new_row',axis=0,inplace=True)

In [24]:
df

    P   Q   R   S   T
A  11  57  28  43  49
B  76  16  99   4  62
C  42  37  91  23  68
D  55  99  99  51  39

# Conditional selection

In [28]:
df

    P   Q   R   S   T
A  11  57  28  43  49
B  76  16  99   4  62
C  42  37  91  23  68
D  55  99  99  51  39

In [30]:
# Select all rows where value of P is greater than 30 
df[df['P']>30]

    P   Q   R   S   T
B  76  16  99   4  62
C  42  37  91  23  68
D  55  99  99  51  39

In [38]:
# select all data where the value is more than 50 
# if the data is missing, it will fill it with NaN values 
df[df > 50]

      P     Q     R     S     T
A  92.0  76.0  51.0   NaN   NaN
B  63.0   NaN   NaN   NaN   NaN
C   NaN  65.0   NaN  80.0   NaN
D  79.0  70.0  99.0   NaN  60.0

In [31]:
df

    P   Q   R   S   T
A  11  57  28  43  49
B  76  16  99   4  62
C  42  37  91  23  68
D  55  99  99  51  39

In [32]:
# multiple selection criteria 
df[(df['P'] > 20) & (df['T'] < 50)]

    P   Q   R   S   T
D  55  99  99  51  39

In [40]:
# suppose , if you want to incorporate the OR condition.
df[(df['P'] > 20) | (df['T'] < 50)]

    P   Q   R   S   T
A  92  76  51  16  29
B  63  43  37  27   2
C  18  65   2  80  42
D  79  70  99   2  60

In [33]:
# let us create a new data frame called df to explain the operations in pandas
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [34]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Operations

In [35]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
# To find the unique elements 
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [37]:
# if you want to find the number of unique elements 
df['col2'].nunique()

3

In [40]:
# we can also count how many times a particular value is present in the dataframe 
df['col2'].value_counts().head()

444    2
555    1
666    1
Name: col2, dtype: int64

In [49]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [50]:
new1df = df[(df['col1']>2) | (df['col2']==444)]
new1df

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

# Most Useful -> Applying Functions

In [52]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
def multby2(x):
    return (x*2)

In [54]:
# We can use a function to effect changes over the entire dataframe and store it in a different column
df['col4'] = df['col2'].apply(multby2)
df

   col1  col2 col3  col4
0     1   444  abc   888
1     2   555  def  1110
2     3   666  ghi  1332
3     4   444  xyz   888

In [55]:
# In most cases, we use the lambda function to write the code in a single line 
df['col4'] = df['col2'].apply(lambda x : x*3)
df

   col1  col2 col3  col4
0     1   444  abc  1332
1     2   555  def  1665
2     3   666  ghi  1998
3     4   444  xyz  1332

In [56]:
# We can also find the length of each string in the col3 and store it in col5. Here we pass the inbuilt function directly
df['col5'] = df['col3'].apply(len)

In [57]:
df

   col1  col2 col3  col4  col5
0     1   444  abc  1332     3
1     2   555  def  1665     3
2     3   666  ghi  1998     3
3     4   444  xyz  1332     3

In [58]:
# We want to get the index and column names, we can easily do by the following syntax 
df.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [62]:
df

   col1  col2 col3  col4  col5
0     1   444  abc  1332     3
1     2   555  def  1665     3
2     3   666  ghi  1998     3
3     4   444  xyz  1332     3

In [63]:
# deleting a column 
del df['col4']

In [65]:
# deleting another column col5
del df['col5']

In [66]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Set_Index and Reset-Index

In [67]:
# if you want to reset index 
df.reset_index()

   index  col1  col2 col3
0      0     1   444  abc
1      1     2   555  def
2      2     3   666  ghi
3      3     4   444  xyz

In [68]:
# if you want to set index to a particular string 
df['Class'] = 'A B C D'.split()

In [69]:
df

   col1  col2 col3 Class
0     1   444  abc     A
1     2   555  def     B
2     3   666  ghi     C
3     4   444  xyz     D

In [70]:
df.set_index('Class',inplace=True)
df

       col1  col2 col3
Class
A         1   444  abc
B         2   555  def
C         3   666  ghi
D         4   444  xyz

In [71]:
# Now , we can access the data using the .loc operator 
df.loc['A']

col1      1
col2    444
col3    abc
Name: A, dtype: object

# Sorting

In [72]:
df

       col1  col2 col3
Class
A         1   444  abc
B         2   555  def
C         3   666  ghi
D         4   444  xyz

In [73]:
# you can sort by the values in a particular column 
df['col2'].sort_values(ascending=True)

Class
A    444
D    444
B    555
C    666
Name: col2, dtype: int64

In [74]:
# you can sort the entire data frame by the values in a particular column 
df.sort_values(by='col2',ascending = False)

       col1  col2 col3
Class
C         3   666  ghi
B         2   555  def
A         1   444  abc
D         4   444  xyz

# Renaming columns

In [75]:
# we pass the values in a dictionary 
df.rename(columns= {'col1':'Roll Number','col2':'Marks','col3':'Student_Name'},inplace=True)

In [76]:
df

       Roll Number  Marks Student_Name
Class
A                1    444          abc
B                2    555          def
C                3    666          ghi
D                4    444          xyz

In [77]:
# We can now sort using multiple conditions 
df.sort_values(by=['Marks','Student_Name'])

       Roll Number  Marks Student_Name
Class
A                1    444          abc
D                4    444          xyz
B                2    555          def
C                3    666          ghi

# Treating Missing Values

In [79]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [80]:
# How to find the number of missing values in each column, we have a small trick here
# We can use the combination of isnull and sum functions 
# isnull() returns a boolean operator , 1- True and 0- False and sum() sums all the one's or True outputs
df.isnull().sum()

col1    1
col2    1
col3    0
dtype: int64

In [81]:
# We want to drop the missing values, how would you go about doing that ??
# dropna function actually removes all the rows and columns which has the missing values - characterised by NaN presence
df.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [82]:
# Now you dont want to drop the columns which has missing values 
df.dropna(axis=1)

  col3
0  abc
1  def
2  ghi
3  xyz

In [83]:
# Now you dont want to drop the rows which has missing values 
# remember in pandas, axis=0 means rows and axis =1 means columns 
df.dropna(axis=0)

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [84]:
# when we check the dataframe, we notice that dataframe is still intact
# Thats because we have not given inplace= True in our command
# when we give inplace= True, it gives a permanent change 
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [85]:
# If we want to fill all the missing values with a string, we can use this command
df.fillna(value='FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [86]:
# you also have some flexibility with the number of missing values you can keep in the columns 
df.dropna(axis = 1, thresh=1)
# thresh actually accounts for the number of non-missing values that should be in the columns

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [87]:
df1 = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [88]:
df1.dropna(axis=1,thresh = 2)
# so , in essence, axis=1 drops columns and thresh=2 says you should have atleast 2 non-missing values in those cols.

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [89]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [90]:
# so in most of the cases, in order to not lose information, we rarely drop the columns , 
# we generally fill all the missing values by the mean value of the column

In [91]:
# let us take column A , we can do it by this command
df1['A'].fillna(value = df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64